Model: "model_26"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_29 (InputLayer)        [(None, 273)]             0         
_________________________________________________________________
dense_133 (Dense)            (None, 150)               41100     
_________________________________________________________________
dense_134 (Dense)            (None, 50)                7550      
_________________________________________________________________
Feature_latent (Dense)       (None, 10)                510       
_________________________________________________________________
dense_135 (Dense)            (None, 50)                550       
_________________________________________________________________
dense_136 (Dense)            (None, 150)               7650      
_________________________________________________________________
dense_137 (Dense)            (None, 273)               41223     
=================================================================
Total params: 98,583
Trainable params: 98,583
Non-trainable params: 0
_________________________________________________________________